Week8/A_SwissCheeseFlow/Ab_flowSwissCheeseSimple/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 200;

boundaryField
{
    "sphereRegion.*"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    left
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.01; //Taking the sphere diameter
        value           $internalField;
    }

    right
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    outside
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
